uhnp/src/Documents/УстановкаБлокировокЯчеек/УстановкаБлокировокЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаБлокировокЯчеек</name>
  <basedOn>Document.ОтборРазмещениеТоваров</basedOn>
  <registerRecords>InformationRegister.БлокировкиСкладскихЯчеек</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СкладскиеЯчейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипБлокировки</name>
      <type>
        <types>EnumRef.ТипыБлокировокСкладскихЯчеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/БлокировкиСкладскихЯчеек/БлокировкиСкладскихЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БлокировкиСкладскихЯчеек</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТипБлокировки</name>
    <type>
      <types>EnumRef.ТипыБлокировокСкладскихЯчеек</types>
    </type>
  </resources>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/ТоварыВЯчейках/ТоварыВЯчейках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВЯчейках</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтбору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КРазмещению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/СтатусыОтборовРазмещенийТоваров/СтатусыОтборовРазмещенийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтборовРазмещенийТоваров</name>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВыполненоБезОшибок</name>
  </enumValues>
  <enumValues>
    <name>ВыполненоСОшибками</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыБлокировокСкладскихЯчеек/ТипыБлокировокСкладскихЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБлокировокСкладскихЯчеек</name>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Полная</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ОтборРазмещениеТоваров/ОтборРазмещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтборРазмещениеТоваров</name>
  <basedOn>Document.ОрдерНаПеремещениеТоваров</basedOn>
  <basedOn>Document.ПриходныйОрдерНаТовары</basedOn>
  <basedOn>Document.РасходныйОрдерНаТовары</basedOn>
  <basedOn>Document.ОтборРазмещениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКОтбору</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийОтбораРазмещенияТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтгрузки</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаПриемки</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийУчасток</name>
    <type>
      <types>CatalogRef.РабочиеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
      <types>DocumentRef.ОрдерНаПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтборовРазмещенийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемРазмещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесРазмещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполнения</name>
    <comment>Дата перевода в статус &quot;В работе&quot;</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыполнения</name>
    <comment>Дата перевода в статус &quot;Выполнено&quot;</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыОтбор</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокОтобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыРазмещение</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРазмещено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокРазмещено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/УстановкаБлокировокЯчеек/ObjectModule.bsl
#Если НЕ МобильныйАвтономныйСервер Тогда
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	Если Не (ДанныеЗаполнения <> Неопределено
		И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения))) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтборРазмещениеТоваров") Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,"Проведен,Статус,Склад,Помещение");
		
		Если Не ЗначенияРеквизитов.Проведен Тогда
			ТекстСообщения = НСтр("ru = 'Ввод на основании возможен только по проведенным документам!';
									|en = 'You can generate a new document only from a posted document.'");
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
		Если ЗначенияРеквизитов.Статус <> Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоСОшибками Тогда
			ТекстСообщения = НСтр("ru = 'Ввод установки блокировки возможен только на основании задания на отбор (размещение) в статусе %Выполнено%';
									|en = 'You can lock a storage bin only if the document status is %Выполнено%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Выполнено%", Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоСОшибками);
			ВызватьИсключение ТекстСообщения;
		Иначе
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ЗначенияРеквизитов, "Склад, Помещение");
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.Ячейка,
			|	СУММА(ВложенныйЗапрос.КоличествоЯчеекРазмещение) КАК КоличествоЯчеекРазмещение,
			|	СУММА(ВложенныйЗапрос.КоличествоЯчеекОтбор) КАК КоличествоЯчеекОтбор
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОтборРазмещениеТоваровТоварыОтбор.Ячейка КАК Ячейка,
			|		0 КАК КоличествоЯчеекРазмещение,
			|		1 КАК КоличествоЯчеекОтбор
			|	ИЗ
			|		Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК ОтборРазмещениеТоваровТоварыОтбор
			|	ГДЕ
			|		ОтборРазмещениеТоваровТоварыОтбор.Ссылка = &Ссылка
			|		И ОтборРазмещениеТоваровТоварыОтбор.КоличествоУпаковок <> ОтборРазмещениеТоваровТоварыОтбор.КоличествоУпаковокОтобрано
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ОтборРазмещениеТоваровТоварыРазмещение.Ячейка,
			|		1,
			|		0
			|	ИЗ
			|		Документ.ОтборРазмещениеТоваров.ТоварыРазмещение КАК ОтборРазмещениеТоваровТоварыРазмещение
			|	ГДЕ
			|		ОтборРазмещениеТоваровТоварыРазмещение.Ссылка = &Ссылка
			|		И ОтборРазмещениеТоваровТоварыРазмещение.КоличествоУпаковок <> ОтборРазмещениеТоваровТоварыРазмещение.КоличествоУпаковокРазмещено) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Ячейка
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВложенныйЗапрос.Ячейка.Код";
			
			Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = СкладскиеЯчейки.Добавить();
				НоваяСтрока.Ячейка = Выборка.Ячейка;
				
				Если Выборка.КоличествоЯчеекОтбор > 0
					И Выборка.КоличествоЯчеекРазмещение = 0 Тогда
					// Значит количества не сходятся только в ТЧ Отбор
					// блокируем на отбор.
					НоваяСтрока.ТипБлокировки = Перечисления.ТипыБлокировокСкладскихЯчеек.Отбор;
				ИначеЕсли Выборка.КоличествоЯчеекРазмещение > 0
					И Выборка.КоличествоЯчеекОтбор = 0 Тогда
					// Значит количества не сходятся только в ТЧ Размещение
					// блокируем на размещение.
					НоваяСтрока.ТипБлокировки = Перечисления.ТипыБлокировокСкладскихЯчеек.Размещение;
				Иначе
					// Значит количества не сходятся в обеих ТЧ
					// блокируем на полностью.
					НоваяСтрока.ТипБлокировки = Перечисления.ТипыБлокировокСкладскихЯчеек.Полная;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьЯчейкиПередБлокировкой(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ИнициализироватьДокумент();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если Не СкладыСервер.ИспользоватьСкладскиеПомещения(Склад,Дата) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Помещение");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)

	Ответственный = Пользователи.ТекущийПользователь();
	Склад         = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);

КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ПроверитьЯчейкиПередБлокировкой(Отказ)
	
	Блокировка = Новый БлокировкаДанных;

	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.БлокировкиСкладскихЯчеек");
	ЭлементБлокировки.Режим          = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СкладскиеЯчейки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ячейка", "Ячейка");
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыВЯчейках");
	ЭлементБлокировки.Режим          = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки.ИсточникДанных = СкладскиеЯчейки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ячейка", "Ячейка");
	
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	ТоварыВЯчейкахОстатки.КОтборуОстаток КАК КОтборуОстаток,
	|	ТоварыВЯчейкахОстатки.КРазмещениюОстаток КАК КРазмещениюОстаток,
	|	УстановкаБлокировокЯчеекСкладскиеЯчейки.ТипБлокировки КАК ТипБлокировки
	|ИЗ
	|	Документ.УстановкаБлокировокЯчеек.СкладскиеЯчейки КАК УстановкаБлокировокЯчеекСкладскиеЯчейки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Ячейка В
	|					(ВЫБРАТЬ
	|						УстановкаБлокировокЯчеекСкладскиеЯчейки.Ячейка КАК Ячейка
	|					ИЗ
	|						Документ.УстановкаБлокировокЯчеек.СкладскиеЯчейки КАК УстановкаБлокировокЯчеекСкладскиеЯчейки
	|					ГДЕ
	|						УстановкаБлокировокЯчеекСкладскиеЯчейки.Ссылка = &Ссылка)) КАК ТоварыВЯчейкахОстатки
	|		ПО УстановкаБлокировокЯчеекСкладскиеЯчейки.Ячейка = ТоварыВЯчейкахОстатки.Ячейка
	|ГДЕ
	|	(ТоварыВЯчейкахОстатки.КОтборуОстаток <> 0
	|				И (УстановкаБлокировокЯчеекСкладскиеЯчейки.ТипБлокировки = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировокСкладскихЯчеек.Полная)
	|					ИЛИ УстановкаБлокировокЯчеекСкладскиеЯчейки.ТипБлокировки = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировокСкладскихЯчеек.Отбор))
	|			ИЛИ ТоварыВЯчейкахОстатки.КРазмещениюОстаток <> 0
	|				И (УстановкаБлокировокЯчеекСкладскиеЯчейки.ТипБлокировки = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировокСкладскихЯчеек.Полная)
	|					ИЛИ УстановкаБлокировокЯчеекСкладскиеЯчейки.ТипБлокировки = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировокСкладскихЯчеек.Размещение)))
	|	И УстановкаБлокировокЯчеекСкладскиеЯчейки.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ячейка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипБлокировки = Перечисления.ТипыБлокировокСкладскихЯчеек.Размещение Тогда
			ТекстСообщения = НСтр("ru = 'Ячейка %Ячейка% не может быть заблокирована с типом блокировки ""%ТипБлокировки%"":
									   |есть невыполненные задания на размещение товара в ячейку';
									   |en = 'Cannot lock storage bin %Ячейка% to perform operation: %ТипБлокировки%.:
									   |The storage bin is busy with another operation: Inventory put-away.'");
		ИначеЕсли Выборка.ТипБлокировки = Перечисления.ТипыБлокировокСкладскихЯчеек.Отбор Тогда
			ТекстСообщения = НСтр("ru = 'Ячейка %Ячейка% не может быть заблокирована с типом блокировки ""%ТипБлокировки%"":
									   |есть невыполненные задания на отбор товара из ячейки';
									   |en = 'Cannot lock storage bin %Ячейка% to perform operation: %ТипБлокировки%.:
									   |The storage bin is busy with another operation: Inventory picking.'");
		ИначеЕсли Выборка.ТипБлокировки = Перечисления.ТипыБлокировокСкладскихЯчеек.Полная Тогда
			ТекстСообщения = НСтр("ru = 'Ячейка %Ячейка% не может быть заблокирована с типом блокировки ""%ТипБлокировки%"":
									   |есть невыполненные задания на %Действие%';
									   |en = 'Cannot lock storage bin %Ячейка% to perform operation: %ТипБлокировки%.
									   |The storage bin is busy with another operation: %Действие%.'");
			//
			Если Выборка.КОтборуОстаток <> 0
			     И Выборка.КРазмещениюОстаток <> 0 Тогда
				 ТекстДействия = НСтр("ru = 'отбор и размещение товара в ячейку';
										|en = 'Inventory transfer'");
			ИначеЕсли Выборка.КОтборуОстаток <> 0 Тогда
				 ТекстДействия = НСтр("ru = 'отбор товара из ячейки';
										|en = 'Inventory picking'");
			ИначеЕсли Выборка.КРазмещениюОстаток <> 0 Тогда
				 ТекстДействия = НСтр("ru = 'размещение в ячейку';
										|en = 'Inventory put-away'");
			КонецЕсли;
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Действие%", ТекстДействия);
			
		КонецЕсли;
			
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ячейка%", Выборка.Ячейка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипБлокировки%", Выборка.ТипБлокировки);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
#КонецЕсли
